thiagohersan/RemoteControl_esp8266/handlers.h
#include <ESP8266WebServer.h>
#include <ArduinoJson.h>
#include <IRremoteESP8266.h>
#include <IRsend.h>

#include "codes.h"

const short IR_PIN = D2;
const short LED_PIN = D4;

ESP8266WebServer mServer(80);
IRsend mIRsend(IR_PIN);
const int COMMAND_DELAY_MILLIS = 300;

String buildHelpResponse() {
  StaticJsonBuffer<1024> buttonBuffer;
  JsonObject& mButtons = buttonBuffer.parseObject(codesJson);
  JsonObject& commands = mButtons["lg"];

  String response = "\
<h3>Para enviar comandos para o controle, \
    fa&ccedil;a um POST a esse endere&ccedil;o com um json no seguinte formato:\n\
</h3>\n\
\n\
<pre>\n\
  {\n\
    \'type\': \'(LG | SAMSUNG)\',\n\
    \'commands\': [\n\
      \'COMMAND_0\',\n\
      \'COMMAND_1\',\n\
      \'COMMAND_2\',\n\
      ...\n\
    ]\n\
  }\n\
</pre>\n\
<h3>Onde <code>[ \'COMMAND_0\', \'COMMAND_1\', \'COMMAND_2\', ... ]</code> &eacute; uma lista com os seguintes poss&iacute;veis comandos:\
</h3>\n";

  response += "<ul>";
  for (auto command : commands) {
    response += "<li>" + String(command.key) + " </li>\n";
  }
  response += " </ul>";

  return response;
}

const String helpResponse = buildHelpResponse();

void handleNotFound() {
  String errorMessage = "<h2>404: " + mServer.uri() + " not found on this server</h2>\n\n";
  errorMessage += helpResponse;
  mServer.send(404, "text/html", errorMessage);
}

void handleRootGet() {
  mServer.send(200, "text/html", helpResponse);
}

void handleRootPost() {
  StaticJsonBuffer<1024> buttonBuffer;
  JsonObject& mButtons = buttonBuffer.parseObject(codesJson);

  StaticJsonBuffer<512> jsonBuffer;
  JsonObject& root = jsonBuffer.parseObject(mServer.arg("plain"));

  if (!root.success()) {
    mServer.send(500, "text/plain", String("invalid json parameter"));
  }

  String remoteType = "lg";
  if (root["type"].as<String>() != "") {
    remoteType = root["type"].as<String>();
    remoteType.toLowerCase();
  }

  JsonArray& commands = root["commands"];
  for (auto cmd : commands) {
    JsonVariant code = mButtons[remoteType][cmd.as<String>()];
    if (code.success()) {
      digitalWrite(LED_PIN, LOW);
      if (remoteType == "samsung") {
        mIRsend.sendSAMSUNG(code.as<int>(), 32, 1);
      } else {
        mIRsend.sendNEC(code.as<int>(), 32, 1);
      }
      delay(COMMAND_DELAY_MILLIS);
      digitalWrite(LED_PIN, HIGH);
    }
  }

  mServer.send(200, "text/plain", String("success"));
}

void setupHandlers() {
  pinMode(LED_PIN, OUTPUT);
  digitalWrite(LED_PIN, HIGH);
  mServer.on("/", HTTP_GET, handleRootGet);
  mServer.on("/", HTTP_POST, handleRootPost);
  mServer.onNotFound(handleNotFound);
}

